Autodesk.Revit.DB.ColorFillLegend.SetColumnWidths(System.Collections.Generic.IList{System.Double})
Sets array of column widths.
Remarks:
Input array length must be the same as what Autodesk.Revit.DB.ColorFillLegend.GetColumnWidths returns. It can only contain positive values.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Array is not valid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.ColorFillLegend.GetColumnWidths
Returns array of column widths in the legend.
Since:
2022

Autodesk.Revit.DB.ColorFillLegend.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.XYZ)
Creates new instance of ColorFillLegend.
Remarks:
Use Autodesk.Revit.DB.View.SupportedColorFillCategoryIds to get list of supported categories.
document:
The document.
viewId:
The id of the view to place legend in.
catetoryId:
The id of category that color fill scheme belongs to.
origin:
The origin point of the legend, must be on the view plane.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
There's no valid color fill scheme applied for catetoryId in viewId.
-or-
The origin is not on the view plane.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2022

Autodesk.Revit.DB.ColorFillLegend.Origin
The top left corner of the color fill legend.
Remarks:
The origin point must be on the view plane this legend is placed on.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The origin is not on the view plane that this legend is placed on.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.ColorFillLegend.Height
The height of the legend.
Remarks:
Changing the height may result in a change in the count of columns.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for height must be positive.
Since:
2022

Autodesk.Revit.DB.ColorFillLegend.ColorFillCategoryId
Returns the id of color fill category that this legend is created for.
Since:
2022

Autodesk.Revit.DB.ColorFillLegend
Represents color fill legend.
Remarks:
Color fill legend is a 2D annotation element, it can be created through Autodesk.Revit.DB.ColorFillLegend.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.XYZ) with specified category of color fill scheme,
if there exists a valid color fill scheme activated for the category in the view. After a legend is created, its content and layout will
keep consistent with the active color fill scheme of the view. You can adjust its position through Autodesk.Revit.DB.ColorFillLegend.Origin property,
or manually maintain its layout through Autodesk.Revit.DB.ColorFillLegend.Height property andAutodesk.Revit.DB.ColorFillLegend.GetColumnWidths/Autodesk.Revit.DB.ColorFillLegend.SetColumnWidths(System.Collections.Generic.IList`1{System.Double}) methods.
Notes:
Autodesk.Revit.DB.View.GetColorFillSchemeId(Autodesk.Revit.DB.ElementId) could be used to retrieve the corresponding color fill scheme of this legend, through the
Autodesk::Revit::DB::View::ColorFillCategoryId and Autodesk.Revit.DB.Element.OwnerViewId properties. Note that there could only exist one active scheme for all spatial categories
(rooms, areas, and zones) in one view.
Once the height and column widths are explicitly set, they will be fixed even if the contents of the legend change.
To retrieve correct height and column widths, it's better to manually retrieve the geometry of legend for nonvisible views.
(Because color fill legend is a view specific element.)
The value of Autodesk.Revit.DB.ColorFillLegend.Height property does not contain the line that displays "Calculating...".
Since:
2022